#### Terraform Format and Style 🖌`success`
#### Terraform Lint 🔨`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```tf

terraform
Acquiring state lock. This may take a few moments...
module.network.google_compute_address.tf_gcp_prod: Refreshing state... [id=projects/nth-infusion-392203/regions/asia-northeast1/addresses/tf-gcp-prod]
module.iam.google_service_account.gce: Refreshing state... [id=projects/nth-infusion-392203/serviceAccounts/google-compute-engine@nth-infusion-392203.iam.gserviceaccount.com]
module.storage.google_storage_bucket.tf_gcp_prod: Refreshing state... [id=tf-gcp-prod]
module.network.google_compute_network.tf_gcp: Refreshing state... [id=projects/nth-infusion-392203/global/networks/tf-gcp]
module.network.google_compute_firewall.allow_http: Refreshing state... [id=projects/nth-infusion-392203/global/firewalls/allow-http]
module.network.google_compute_firewall.allow_ssh: Refreshing state... [id=projects/nth-infusion-392203/global/firewalls/allow-ssh]
module.network.google_compute_subnetwork.tf_gcp_prod: Refreshing state... [id=projects/nth-infusion-392203/regions/asia-northeast1/subnetworks/tf-gcp-prod]
module.compute.google_compute_instance.tf_gcp_prod_3: Refreshing state... [id=projects/nth-infusion-392203/zones/asia-northeast1-a/instances/tf-gcp-prod-3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.compute.google_compute_instance.tf_gcp_prod_1 will be created
  + resource "google_compute_instance" "tf_gcp_prod_1" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-medium"
      + metadata             = {
          + "ssh-keys" = <<-EOT
                tf-gcp-prod:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC7pcR0wW5fDb2fHWewnTfPzG7tX9bpxPG18tw/gfSbYOm4h8YWFCgsRHUKm78C4J5fV27uGCgaAakZR772w+YwaQop3FtrsgUvjpSDaVE7cGrMuNg5TscLgXDA2N4BOpzb6ZEcX9wGi4A+CIRk/Uhchb8MBvBg40spPLCVJJ4+j5HAgZvi+yHjQt+dATN+MVA1vDX3OHdWC8oySF2ePpeE/x0eQthDSk00+XpshkL1kwPdivGNNVp1v2Da57t3uvBbp9y+hD6sB84Dz5un0nhCSDk5a3smjgkJgB+lbfnYDPQdnYLfY/sNMmHnQckqANEdkfXr1IF8AWUGZMMyqo0vTVreg01+7VZ1ceGk7DvYH+5OWcNaDMJlI9gLzE7xxHk5YuR9N1InGGz5YWYUUjvQyK17S4iFucSPttIrOMWA21aLtsW0GsHsDbma3KffVouDQWWgcw7j1WyyflPy0E95LAtnWPxl5W+7bmZAeb9SsOulD2ySPPlr3B7oO2u/Fn0= dongminlee@Dongmins-MacBook-Pro.local
            EOT
        }
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "tf-gcp-prod-1"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "allow-http",
          + "allow-ssh",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "asia-northeast1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-2004-focal-v20230724"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "projects/nth-infusion-392203/regions/asia-northeast1/subnetworks/tf-gcp-prod"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + service_account {
          + email  = "google-compute-engine@nth-infusion-392203.iam.gserviceaccount.com"
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

  # module.compute.google_compute_instance.tf_gcp_prod_2 will be created
  + resource "google_compute_instance" "tf_gcp_prod_2" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-medium"
      + metadata             = {
          + "ssh-keys" = <<-EOT
                tf-gcp-prod:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC7pcR0wW5fDb2fHWewnTfPzG7tX9bpxPG18tw/gfSbYOm4h8YWFCgsRHUKm78C4J5fV27uGCgaAakZR772w+YwaQop3FtrsgUvjpSDaVE7cGrMuNg5TscLgXDA2N4BOpzb6ZEcX9wGi4A+CIRk/Uhchb8MBvBg40spPLCVJJ4+j5HAgZvi+yHjQt+dATN+MVA1vDX3OHdWC8oySF2ePpeE/x0eQthDSk00+XpshkL1kwPdivGNNVp1v2Da57t3uvBbp9y+hD6sB84Dz5un0nhCSDk5a3smjgkJgB+lbfnYDPQdnYLfY/sNMmHnQckqANEdkfXr1IF8AWUGZMMyqo0vTVreg01+7VZ1ceGk7DvYH+5OWcNaDMJlI9gLzE7xxHk5YuR9N1InGGz5YWYUUjvQyK17S4iFucSPttIrOMWA21aLtsW0GsHsDbma3KffVouDQWWgcw7j1WyyflPy0E95LAtnWPxl5W+7bmZAeb9SsOulD2ySPPlr3B7oO2u/Fn0= dongminlee@Dongmins-MacBook-Pro.local
            EOT
        }
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "tf-gcp-prod-2"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "allow-http",
          + "allow-ssh",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "asia-northeast1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-2004-focal-v20230724"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "projects/nth-infusion-392203/regions/asia-northeast1/subnetworks/tf-gcp-prod"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + service_account {
          + email  = "google-compute-engine@nth-infusion-392203.iam.gserviceaccount.com"
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

  # module.compute.google_compute_instance.tf_gcp_prod_3 will be updated in-place
  ~ resource "google_compute_instance" "tf_gcp_prod_3" {
        id                   = "projects/nth-infusion-392203/zones/asia-northeast1-a/instances/tf-gcp-prod-3"
        name                 = "tf-gcp-prod-3"
        tags                 = [
            "allow-http",
            "allow-ssh",
        ]
        # (17 unchanged attributes hidden)

      ~ network_interface {
            name               = "nic0"
            # (6 unchanged attributes hidden)

          ~ access_config {
              ~ nat_ip       = "34.146.76.121" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.network.google_compute_address.tf_gcp_prod will be destroyed
  # (because google_compute_address.tf_gcp_prod is not in configuration)
  - resource "google_compute_address" "tf_gcp_prod" {
      - address            = "34.146.76.121" -> null
      - address_type       = "EXTERNAL" -> null
      - creation_timestamp = "2023-07-27T01:50:42.001-07:00" -> null
      - id                 = "projects/nth-infusion-392203/regions/asia-northeast1/addresses/tf-gcp-prod" -> null
      - name               = "tf-gcp-prod" -> null
      - network_tier       = "PREMIUM" -> null
      - prefix_length      = 0 -> null
      - project            = "nth-infusion-392203" -> null
      - region             = "asia-northeast1" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/nth-infusion-392203/regions/asia-northeast1/addresses/tf-gcp-prod" -> null
      - users              = [
          - "https://www.googleapis.com/compute/v1/projects/nth-infusion-392203/zones/asia-northeast1-a/instances/tf-gcp-prod-3",
        ] -> null
    }

  # module.network.google_compute_address.tf_gcp_prod_1 will be created
  + resource "google_compute_address" "tf_gcp_prod_1" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "tf-gcp-prod-1"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "asia-northeast1"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # module.network.google_compute_address.tf_gcp_prod_2 will be created
  + resource "google_compute_address" "tf_gcp_prod_2" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "tf-gcp-prod-2"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "asia-northeast1"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # module.network.google_compute_address.tf_gcp_prod_3 will be created
  + resource "google_compute_address" "tf_gcp_prod_3" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "tf-gcp-prod-3"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "asia-northeast1"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

Plan: 5 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dongminlee94, Action: `pull_request`, Workflow: `[Repo CI] Integrate Terraform with GCP`*